In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from sqlalchemy import create_engine, inspect

In [2]:
path = "sqlite:///Resources/hawaii.sqlite"
engine = create_engine(path)
conn = engine.connect()

In [3]:
inspector = inspect(engine)

tables = inspector.get_table_names()
tables

['measurement', 'station']

In [4]:
query = """
        SELECT
            date,
            sum(prcp)
        FROM
            measurement
        GROUP BY
            date
        ORDER BY
            date;
        """

df = pd.read_sql(query, conn)
df.head()

         date  sum(prcp)
0  2010-01-01       1.06
1  2010-01-02       0.02
2  2010-01-03       0.00
3  2010-01-04       0.01
4  2010-01-05       0.03

In [22]:
query = """
        SELECT
            tobs,
            date,
            station
        FROM
            measurement
        WHERE
            date >= '2016-08-23'
            AND station = "USC00519281"
        ORDER BY
            date;
        """

pd.read_sql(query, conn)

     tobs        date      station
0    77.0  2016-08-23  USC00519281
1    77.0  2016-08-24  USC00519281
2    80.0  2016-08-25  USC00519281
3    80.0  2016-08-26  USC00519281
4    75.0  2016-08-27  USC00519281
..    ...         ...          ...
347  77.0  2017-08-14  USC00519281
348  77.0  2017-08-15  USC00519281
349  76.0  2017-08-16  USC00519281
350  76.0  2017-08-17  USC00519281
351  79.0  2017-08-18  USC00519281

[352 rows x 3 columns]

In [39]:
date1 = "2012-06-01"
date2 = "2012-08-31"



query = f"""
        SELECT
            date,
            min(tobs) as tmin,
            max(tobs) as tmax,
            avg(tobs) as tavg
        FROM
            measurement
        WHERE
            date = "2012-06-01"
        """


df = pd.read_sql(query, conn)

df

         date  tmin  tmax    tavg
0  2012-06-01  69.0  76.0  72.875

In [40]:
query = f"""
        SELECT
            min(tobs) as tmin,
            max(tobs) as tmax,
            avg(tobs) as tavg
        FROM
            measurement
        WHERE
            date >= '{date1}'
            and date <= '{date2}'
        """


df = pd.read_sql(query, conn)

df

   tmin  tmax       tavg
0  65.0  86.0  74.642638